In [1]:
import pandas as pd
import numpy as np
from numpy import nan as NA

In [2]:
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [3]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [4]:
string_data[0]=None
string_data

0         None
1    artichoke
2          NaN
3      avocado
dtype: object

In [5]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [6]:
s1 = pd.Series([1,2,3,4,5,NA]) #NaN is imported as NA or use np.nan
s1.isnull()

0    False
1    False
2    False
3    False
4    False
5     True
dtype: bool

In [7]:
s1[s1.isnull()]

5   NaN
dtype: float64

In [8]:
s1.notnull()

0     True
1     True
2     True
3     True
4     True
5    False
dtype: bool

In [9]:
s1.dropna() #drop nan value

0    1.0
1    2.0
2    3.0
3    4.0
4    5.0
dtype: float64

In [10]:
s = pd.Series([np.nan,1,2,3,np.nan,4,5,np.nan])
s

0    NaN
1    1.0
2    2.0
3    3.0
4    NaN
5    4.0
6    5.0
7    NaN
dtype: float64

In [13]:
s = pd.Series([NA,1,2,3,NA,4,5,NA])
s

0    NaN
1    1.0
2    2.0
3    3.0
4    NaN
5    4.0
6    5.0
7    NaN
dtype: float64

In [14]:
s = s[s.notnull()] #notnull and dropna from these two we can remove nan values
s

1    1.0
2    2.0
3    3.0
5    4.0
6    5.0
dtype: float64

In [15]:
s = pd.Series([np.nan,1,2,3,np.nan,4,5,np.nan])
s.dropna(inplace=True)
s

1    1.0
2    2.0
3    3.0
5    4.0
6    5.0
dtype: float64

In [23]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],[NA, NA, NA], [NA, 6.5, 3.]])
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [17]:
data.dropna()

     0    1    2
0  1.0  6.5  3.0

In [18]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [24]:
data.iloc[:2,1] = NA # 2 ko bhi include karaega # 0 1 2 index per jo hae aur 1 column

In [25]:
data

     0    1    2
0  1.0  NaN  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [27]:

data.dropna(thresh=2) # atleast 2 non nan values haen tou nnhi hataoo # rows ko dekho

     0    1    2
0  1.0  NaN  3.0
3  NaN  6.5  3.0

In [28]:

data.dropna(thresh=2,axis=1) # column ko dekho

     0    2
0  1.0  3.0
1  1.0  NaN
2  NaN  NaN
3  NaN  3.0

In [31]:
df = pd.DataFrame(np.random.randn(7, 3))
df

          0         1         2
0  0.356541  1.825655 -0.812923
1 -1.628587  0.915642 -0.828906
2 -0.745188  1.150629 -0.544259
3  0.657595 -0.011174 -0.484272
4 -0.854491 -0.603377  0.174394
5  1.564104 -1.574932 -0.759809
6 -0.389552  0.076388  0.172924

In [32]:
df.iloc[:4, 1] = NA
df.iloc[:2, 2] = NA
df

          0         1         2
0  0.356541       NaN       NaN
1 -1.628587       NaN       NaN
2 -0.745188       NaN -0.544259
3  0.657595       NaN -0.484272
4 -0.854491 -0.603377  0.174394
5  1.564104 -1.574932 -0.759809
6 -0.389552  0.076388  0.172924

In [33]:
df.fillna({1: 1,2: 2}) # na per  1 column per 1 aur 2 column walay per 2

          0         1         2
0  0.356541  1.000000  2.000000
1 -1.628587  1.000000  2.000000
2 -0.745188  1.000000 -0.544259
3  0.657595  1.000000 -0.484272
4 -0.854491 -0.603377  0.174394
5  1.564104 -1.574932 -0.759809
6 -0.389552  0.076388  0.172924

In [34]:
df.fillna({1: df[1].mean(),2: df[1].mean()}) #1 column ka mean, 2 column ka mean or fill hojyenge NA ki jagah

          0         1         2
0  0.356541 -0.700640 -0.700640
1 -1.628587 -0.700640 -0.700640
2 -0.745188 -0.700640 -0.544259
3  0.657595 -0.700640 -0.484272
4 -0.854491 -0.603377  0.174394
5  1.564104 -1.574932 -0.759809
6 -0.389552  0.076388  0.172924

In [35]:
df.fillna(method='ffill')

          0         1         2
0  0.356541       NaN       NaN
1 -1.628587       NaN       NaN
2 -0.745188       NaN -0.544259
3  0.657595       NaN -0.484272
4 -0.854491 -0.603377  0.174394
5  1.564104 -1.574932 -0.759809
6 -0.389552  0.076388  0.172924

In [42]:
df[6]=43

In [43]:
df

          0         1         2   6
0  0.356541       NaN       NaN  43
1 -1.628587       NaN       NaN  43
2 -0.745188       NaN -0.544259  43
3  0.657595       NaN -0.484272  43
4 -0.854491 -0.603377  0.174394  43
5  1.564104 -1.574932 -0.759809  43
6 -0.389552  0.076388  0.172924  43

In [44]:
df.fillna(method='ffill')

          0         1         2   6
0  0.356541       NaN       NaN  43
1 -1.628587       NaN       NaN  43
2 -0.745188       NaN -0.544259  43
3  0.657595       NaN -0.484272  43
4 -0.854491 -0.603377  0.174394  43
5  1.564104 -1.574932 -0.759809  43
6 -0.389552  0.076388  0.172924  43

In [45]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],'k2': [1, 1, 2, 3, 3, 4, 4]})

In [46]:
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4